{
  "upcoming": [],
  "past": [
    {
      "title": "Livermore Rotary Outreach",
      "date": "2024-08-20",
      "time": "",
      "location": "Livermore, California",
      "description": "From July to December 2024, the Humane Sleep Project launched a major outreach initiative in Livermore, made possible through a generous $3,500 grant from the Livermore Rotary Club. With these funds, we were able to purchase and distribute 100 sleeping bags, 120 hygiene kits, and 120 blankets to members of the local homeless community. Each kit was thoughtfully assembled with essential items to help individuals meet basic needs and endure the challenges of living without shelter, especially as colder months approached.\n\nThis effort was strengthened by the collaboration and support of several local nonprofits and organizations. Groups such as Cornerstone Church and Shepherd’s Gate partnered with us in distributing the supplies across various parts of Livermore. Their involvement not only expanded our reach but also deepened the collective impact of our mission. Together, we created a network of support that allowed more individuals to be served with care, efficiency, and dignity.\n\nThe Livermore outreach stands as a testament to the power of community partnerships and the tangible difference that targeted funding can make. Through the coordinated efforts of nonprofits, local supporters, and our dedicated team, we were able to bring warmth, hygiene, and hope to over a hundred individuals in need. The Humane Sleep Project remains committed to continuing this momentum and advocating for compassionate responses to homelessness across California.",
      "imageUrl": "https://imgur.com/ZjkvkrR",
      "registrationUrl": "https://imgur.com/ZjkvkrR",
      "id": "1748031311852"
    },
    {
      "title": "Blizzard of Blessings 2023",
      "date": "2023-09-23",
      "time": "",
      "location": "San Jose, San Francisco",
      "description": "The Humane Sleep Project extended its mission of compassion and support to the streets of San Jose and San Francisco. Our team distributed essential supplies to homeless individuals across both cities, aiming to provide not just physical comfort, but also a sense of dignity and care. We handed out sleeping bags and hygiene kits that included toothbrushes, toothpaste, tissues, and other daily necessities, as well as food to help ease the burden of hunger. Each item was selected to address the most immediate needs of those living without stable shelter.\n\nBeyond the supplies, our outreach was also about connection and empathy. Sponsored by nonprofits such as Sewa Diwali and Kannada Kootu, we visited multiple homeless encampments and made it a priority to listen to the stories of the individuals we met. These conversations highlighted the personal struggles, resilience, and humanity behind each person’s circumstances. By simply listening, we offered respect and reminded people that they are not invisible — that someone sees them, values them, and cares about their well-being.\n\nThrough these efforts, the Humane Sleep Project continues to build a foundation of trust and compassion within the communities we serve. Our work in San Jose and San Francisco is just one step in a larger journey to make homelessness more humane and to inspire action from others. We are grateful for every supporter and partner who makes this possible, and we remain committed to bringing resources, hope, and human connection to those who need it most.",
      "imageUrl": "https://imgur.com/a/S52fgby",
      "registrationUrl": "https://imgur.com/a/S52fgby",
      "id": "1748031532877"
    },
    {
      "title": "Livermore-Amador Symphony",
      "date": "2025-02-11",
      "time": "",
      "location": "Livermore, California",
      "description": "In another meaningful act of community support, the Humane Sleep Project partnered with the Livermore Amador Symphony, who donated an estimated $1,500 worth of supplies collected through estate sales. These generous contributions included pillows, hygiene kits, and blankets — all of which were crucial in bringing relief and comfort to the homeless populations in San Jose and Oakland. Our team hand-delivered these items to individuals living in multiple encampments across both cities, continuing our mission of meeting people where they are with both resources and compassion.\n\nThis donation effort not only provided immediate aid to those in need, but it also highlighted the power of creative giving and local partnerships. The Symphony’s support allowed us to expand our outreach without needing to fundraise or purchase new supplies, showing how repurposed goods can have a real impact. By channeling estate sale items into humanitarian aid, we were able to extend the life and purpose of these materials in a way that honored both the donors and recipients.\n\nAs a gesture of community and solidarity, the Livermore Amador Symphony also invited the Humane Sleep Project team to attend one of their performances. Sitting together to enjoy the music was a meaningful moment for our volunteers — a reminder of the beauty that exists in collaboration and the shared humanity behind every effort. This partnership was not just about distributing items; it was about building bridges between organizations, individuals, and the values we all care about.",
      "imageUrl": "https://imgur.com/3Cvwzq0",
      "registrationUrl": "https://imgur.com/3Cvwzq0",
      "id": "1748031769478"
    },
    {
      "title": "Blizzard of Blessings 2024",
      "date": "2024-12-14",
      "time": "",
      "location": "Pleasanton, California",
      "description": "In late 2024, the Humane Sleep Project launched our Blizzard of Blessings outreach, a winter initiative made possible through continued support from our generous sponsors, Kannada Kootu and Sewa Diwali. These two community organizations donated nearly $1,000 worth of essential supplies, which we were able to distribute directly to homeless individuals across Oakland, San Francisco, and San Jose. The donated goods — including winter essentials, hygiene items, and comfort supplies — were a crucial lifeline for many enduring the harsh winter months without shelter.\n\nUnlike some of our other initiatives, the Blizzard of Blessings outreach was carried out entirely by our team. We personally visited encampments and locations where people were in need, ensuring that every item donated was placed directly into the hands of someone who could use it. This hands-on approach helped us connect face-to-face with the individuals we serve, offering not just supplies, but also conversation, empathy, and acknowledgment during a season that can feel particularly isolating for those without homes.\n\nThis effort reaffirmed our commitment to being present and responsive to the needs of our community. Thanks to the continued trust and support of Kannada Kootu and Sewa Diwali, we were able to bring warmth and dignity to dozens of individuals throughout the Bay Area. The Blizzard of Blessings served as a powerful reminder that when communities unite, even in the coldest months, they can bring light and care to those most in need.",
      "imageUrl": "https://imgur.com/p6YzeHt",
      "registrationUrl": "https://imgur.com/p6YzeHt",
      "id": "1748032080843"
    }
  ]
}