{
  "upcoming": [
    {
      "title": "Wesh",
      "date": "2025-09-08",
      "time": "10:00 AM",
      "location": "Owens bux",
      "description": "Ple",
      "imageUrl": "https://assets.vercel.com/image/upload/contentful/image/e5382hct74si/7ut3GGMiv4dFp4RBjpjyFO/5b6ff83c187195cdcf612b10a849c984/OG_Card.png",
      "registrationUrl": "https://assets.vercel.com/image/upload/contentful/image/e5382hct74si/7ut3GGMiv4dFp4RBjpjyFO/5b6ff83c187195cdcf612b10a849c984/OG_Card.png",
      "id": "1746579731892"
    },
    {
      "title": "Sewa Diwali 2023",
      "date": "2023-12-11",
      "time": "",
      "location": "San Jose",
      "description": "Humane Sleep Project is driven by an unwavering sense of duty to expand our outreach. San Jose and Oakland serve as symbolic representations of our commitment to addressing the multi-faceted dimensions of the homelessness crisis. Our mission transcends the mere distribution of sleeping supplies; it encompasses the recognition of the humanity of each individual and the provision of a lasting sense of security as we consistently visit the same encampments.\n\nTo tackle this critical issue, the Humane Sleep Project collaborated with Sewa Diwali and the Kannada Koota of Northern California (KKNC) to secure essential items for distribution. Generously donated by KKNC, the organization received fleece blankets, thermal socks, gloves, and beanies to assemble comprehensive winter warmth kits. Trader Joe's further supported our efforts by providing paper bags for packing the items and has committed to ongoing support through donations of food and additional sleeping supplies.\n\nOver two street outreach days, nearly 100 kits were assembled and distributed, serving as a meaningful contribution to creating a safer winter for California's homeless population. This hands-on approach allowed our organization to witness firsthand the challenging realities faced by unsheltered individuals and the profound impact that even modest acts of kin the Humane Sleep Project is driven by an unwavering sense of duty to expand our outreach. San Jose and Oakland serve as symbolic representations of our commitment to addressing the multi-faceted dimensions of the homelessness crisis. Our mission transcends the mere distribution of sleeping supplies; it encompasses the recognition of the humanity of each individual and the provision of a lasting sense of security as we consistently visit the same encampments.\n\nTo tackle this critical issue, the Humane Sleep Project collaborated with Sewa Diwali and the Kannada Koota of Northern California (KKNC) to secure essential items for distribution. Generously donated by KKNC, the organization received fleece blankets, thermal socks, gloves, and beanies to assemble comprehensive winter warmth kits. Trader Joe's further supported our efforts by providing paper bags for packing the items and has committed to ongoing support through donations of food and additional sleeping supplies.\n\nOver two street outreach days, nearly 100 kits were assembled and distributed, serving as a meaningful contribution to creating a safer winter for California's homeless population. This hands-on approach allowed our organization to witness firsthand the challenging realities faced by unsheltered individuals and the profound impact that even modest acts of kindness can have on their lives\ndness can have on their lives\n",
      "imageUrl": "https://drive.google.com/file/d/1K1cu59eHoXGkQSlWkNXwKtpVYPcCGsnm/view?usp=drivesdk",
      "registrationUrl": "https://drive.google.com/file/d/1K1cu59eHoXGkQSlWkNXwKtpVYPcCGsnm/view?usp=drivesdk",
      "id": "1748022998689"
    }
  ],
  "past": [
    {
      "title": "test past event",
      "date": "2001-09-08",
      "time": "10:00",
      "location": "Dublin, CA",
      "description": "Birth of Vinay",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Hausziege_04.jpg",
      "registrationUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Hausziege_04.jpg",
      "id": "1746652504742"
    }
  ]
}